tuts/1D_CH4_premixed_inletoutlet/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1400
(
5.13667e-15
5.13667e-15
5.13667e-15
5.13667e-15
5.13667e-15
5.13667e-15
5.13667e-15
5.13667e-15
...
)
;

boundaryField
{
    inletBoundary
    {
        type            fixedValue;
        value           uniform 0;
    }
    outletBoundary
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
