tuts/1D_CH4_premixed_inletoutlet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1400
(
(0.376052 0 0)
(0.376052 0 0)
(0.376052 0 0)
(0.376052 0 0)
(0.376052 0 0)
(0.376052 0 0)
(0.376052 0 0)
(0.376052 0 0)
...
)
;

boundaryField
{
    inletBoundary
    {
        type            fixedValue;
        value           uniform (0.37605 0 0);
    }
    outletBoundary
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
