tuts/1D_CH4_premixed_inletoutlet/constant/speciesLambda
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version                         2.0;
format                          ascii;
class                           dictionary;
object                          speciesLambda;
}

// Scheme: transport fitting

H2
{
Lambda1	9.236E+00	;
Lambda2	-4.674E-01	;
Lambda3	1.157E-01	;
Lambda4	-2.596E-03	;
}
H
{
Lambda1	-8.554E-01	;
Lambda2	3.653E+00	;
Lambda3	-3.980E-01	;
Lambda4	1.757E-02	;
}
O
{
Lambda1	1.685E+00	;
Lambda2	1.929E+00	;
Lambda3	-1.739E-01	;
Lambda4	7.841E-03	;
}
O2
{
Lambda1	-1.937E+00	;
Lambda2	2.890E+00	;
Lambda3	-2.710E-01	;
Lambda4	1.153E-02	;
}
OH
{
Lambda1	1.416E+01	;
Lambda2	-3.245E+00	;
Lambda3	5.337E-01	;
Lambda4	-2.328E-02	;
}
H2O
{
Lambda1	2.337E+01	;
Lambda2	-8.966E+00	;
Lambda3	1.529E+00	;
Lambda4	-7.590E-02	;
}
HO2
{
Lambda1	-1.130E+00	;
Lambda2	2.340E+00	;
Lambda3	-1.632E-01	;
Lambda4	5.800E-03	;
}
H2O2
{
Lambda1	8.828E-01	;
Lambda2	1.316E+00	;
Lambda3	1.916E-02	;
Lambda4	-4.417E-03	;
}
C
{
Lambda1	2.042E+00	;
Lambda2	1.706E+00	;
Lambda3	-1.444E-01	;
Lambda4	6.539E-03	;
}
CH
{
Lambda1	2.080E+01	;
Lambda2	-6.240E+00	;
Lambda3	9.821E-01	;
Lambda4	-4.503E-02	;
}
CH2
{
Lambda1	1.292E+01	;
Lambda2	-3.737E+00	;
Lambda3	7.158E-01	;
Lambda4	-3.638E-02	;
}
CH2(S)
{
Lambda1	1.894E+01	;
Lambda2	-6.510E+00	;
Lambda3	1.133E+00	;
Lambda4	-5.696E-02	;
}
CH3
{
Lambda1	1.399E+01	;
Lambda2	-4.642E+00	;
Lambda3	9.076E-01	;
Lambda4	-4.772E-02	;
}
CH4
{
Lambda1	1.331E+01	;
Lambda2	-4.960E+00	;
Lambda3	1.033E+00	;
Lambda4	-5.634E-02	;
}
CO
{
Lambda1	1.188E+01	;
Lambda2	-3.155E+00	;
Lambda3	6.021E-01	;
Lambda4	-3.033E-02	;
}
CO2
{
Lambda1	-1.135E+01	;
Lambda2	5.876E+00	;
Lambda3	-5.678E-01	;
Lambda4	2.032E-02	;
}
HCO
{
Lambda1	6.296E+00	;
Lambda2	-2.225E+00	;
Lambda3	6.369E-01	;
Lambda4	-3.808E-02	;
}
CH2O
{
Lambda1	5.384E+00	;
Lambda2	-2.389E+00	;
Lambda3	7.390E-01	;
Lambda4	-4.581E-02	;
}
CH2OH
{
Lambda1	1.062E+00	;
Lambda2	4.055E-02	;
Lambda3	3.317E-01	;
Lambda4	-2.409E-02	;
}
CH3O
{
Lambda1	-6.138E+00	;
Lambda2	2.471E+00	;
Lambda3	6.477E-02	;
Lambda4	-1.455E-02	;
}
CH3OH
{
Lambda1	-1.839E+00	;
Lambda2	5.576E-01	;
Lambda3	3.510E-01	;
Lambda4	-2.854E-02	;
}
C2H
{
Lambda1	1.336E+01	;
Lambda2	-4.326E+00	;
Lambda3	8.368E-01	;
Lambda4	-4.380E-02	;
}
C2H2
{
Lambda1	-7.691E+00	;
Lambda2	4.564E+00	;
Lambda3	-4.041E-01	;
Lambda4	1.405E-02	;
}
C2H3
{
Lambda1	-9.095E+00	;
Lambda2	4.544E+00	;
Lambda3	-3.176E-01	;
Lambda4	6.571E-03	;
}
C2H4
{
Lambda1	-1.461E+01	;
Lambda2	6.360E+00	;
Lambda3	-5.035E-01	;
Lambda4	1.260E-02	;
}
C2H5
{
Lambda1	-8.942E+00	;
Lambda2	4.022E+00	;
Lambda3	-1.836E-01	;
Lambda4	-1.963E-03	;
}
C2H6
{
Lambda1	-1.098E+01	;
Lambda2	4.703E+00	;
Lambda3	-2.518E-01	;
Lambda4	1.533E-04	;
}
HCCO
{
Lambda1	-5.966E+00	;
Lambda2	4.394E+00	;
Lambda3	-3.977E-01	;
Lambda4	1.398E-02	;
}
CH2CO
{
Lambda1	-8.329E+00	;
Lambda2	3.971E+00	;
Lambda3	-2.213E-01	;
Lambda4	1.484E-03	;
}
HCCOH
{
Lambda1	-5.368E+00	;
Lambda2	2.984E+00	;
Lambda3	-1.147E-01	;
Lambda4	-2.123E-03	;
}
N
{
Lambda1	1.965E+00	;
Lambda2	1.706E+00	;
Lambda3	-1.444E-01	;
Lambda4	6.539E-03	;
}
NH
{
Lambda1	1.174E+01	;
Lambda2	-2.217E+00	;
Lambda3	4.008E-01	;
Lambda4	-1.754E-02	;
}
NH2
{
Lambda1	1.970E+01	;
Lambda2	-6.065E+00	;
Lambda3	1.008E+00	;
Lambda4	-4.811E-02	;
}
NH3
{
Lambda1	1.537E+01	;
Lambda2	-5.951E+00	;
Lambda3	1.176E+00	;
Lambda4	-6.297E-02	;
}
NNH
{
Lambda1	7.412E+00	;
Lambda2	-1.552E+00	;
Lambda3	4.241E-01	;
Lambda4	-2.374E-02	;
}
NO
{
Lambda1	9.566E+00	;
Lambda2	-2.131E+00	;
Lambda3	4.544E-01	;
Lambda4	-2.335E-02	;
}
NO2
{
Lambda1	-1.390E+01	;
Lambda2	7.264E+00	;
Lambda3	-7.969E-01	;
Lambda4	3.249E-02	;
}
N2O
{
Lambda1	-1.146E+01	;
Lambda2	6.034E+00	;
Lambda3	-6.061E-01	;
Lambda4	2.281E-02	;
}
HNO
{
Lambda1	1.575E+01	;
Lambda2	-5.146E+00	;
Lambda3	9.255E-01	;
Lambda4	-4.610E-02	;
}
CN
{
Lambda1	4.413E-01	;
Lambda2	2.195E+00	;
Lambda3	-2.300E-01	;
Lambda4	1.258E-02	;
}
HCN
{
Lambda1	1.344E+00	;
Lambda2	1.011E-02	;
Lambda3	3.034E-01	;
Lambda4	-2.142E-02	;
}
H2CN
{
Lambda1	-2.438E+00	;
Lambda2	1.171E+00	;
Lambda3	2.065E-01	;
Lambda4	-1.961E-02	;
}
HCNN
{
Lambda1	-7.350E+00	;
Lambda2	4.963E+00	;
Lambda3	-4.730E-01	;
Lambda4	1.722E-02	;
}
HCNO
{
Lambda1	-1.180E+01	;
Lambda2	6.050E+00	;
Lambda3	-5.778E-01	;
Lambda4	2.018E-02	;
}
HOCN
{
Lambda1	-3.190E+00	;
Lambda2	2.427E+00	;
Lambda3	-7.625E-02	;
Lambda4	-2.814E-03	;
}
HNCO
{
Lambda1	-6.277E+00	;
Lambda2	3.682E+00	;
Lambda3	-2.441E-01	;
Lambda4	4.671E-03	;
}
NCO
{
Lambda1	-1.120E+01	;
Lambda2	5.944E+00	;
Lambda3	-5.907E-01	;
Lambda4	2.177E-02	;
}
N2
{
Lambda1	1.293E+01	;
Lambda2	-3.528E+00	;
Lambda3	6.456E-01	;
Lambda4	-3.194E-02	;
}
AR
{
Lambda1	-3.167E+00	;
Lambda2	3.467E+00	;
Lambda3	-3.746E-01	;
Lambda4	1.658E-02	;
}
C3H7
{
Lambda1	-1.927E+01	;
Lambda2	8.393E+00	;
Lambda3	-8.051E-01	;
Lambda4	2.739E-02	;
}
C3H8
{
Lambda1	-1.938E+01	;
Lambda2	8.298E+00	;
Lambda3	-7.713E-01	;
Lambda4	2.502E-02	;
}
CH2CHO
{
Lambda1	-6.275E+00	;
Lambda2	2.905E+00	;
Lambda3	-4.359E-02	;
Lambda4	-7.775E-03	;
}
CH3CHO
{
Lambda1	-9.884E+00	;
Lambda2	4.139E+00	;
Lambda3	-1.750E-01	;
Lambda4	-3.281E-03	;
}
