tuts/1D_CH4_premixed_inletoutlet/constant/speciesMu
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version                         2.0;
format                          ascii;
class                           dictionary;
object                          speciesMu;
}

// Scheme: transport fitting

H2
{
Mu1	-1.384E+01	;
Mu2	1.003E+00	;
Mu3	-5.016E-02	;
Mu4	2.331E-03	;
}
H
{
Mu1	-2.041E+01	;
Mu2	3.653E+00	;
Mu3	-3.980E-01	;
Mu4	1.757E-02	;
}
O
{
Mu1	-1.510E+01	;
Mu2	1.929E+00	;
Mu3	-1.739E-01	;
Mu4	7.841E-03	;
}
O2
{
Mu1	-1.716E+01	;
Mu2	2.678E+00	;
Mu3	-2.722E-01	;
Mu4	1.214E-02	;
}
OH
{
Mu1	-1.507E+01	;
Mu2	1.929E+00	;
Mu3	-1.739E-01	;
Mu4	7.841E-03	;
}
H2O
{
Mu1	-1.056E+01	;
Mu2	-1.378E+00	;
Mu3	4.214E-01	;
Mu4	-2.414E-02	;
}
HO2
{
Mu1	-1.714E+01	;
Mu2	2.678E+00	;
Mu3	-2.722E-01	;
Mu4	1.214E-02	;
}
H2O2
{
Mu1	-1.713E+01	;
Mu2	2.678E+00	;
Mu3	-2.722E-01	;
Mu4	1.214E-02	;
}
C
{
Mu1	-1.503E+01	;
Mu2	1.706E+00	;
Mu3	-1.444E-01	;
Mu4	6.539E-03	;
}
CH
{
Mu1	-1.520E+01	;
Mu2	1.929E+00	;
Mu3	-1.739E-01	;
Mu4	7.841E-03	;
}
CH2
{
Mu1	-2.026E+01	;
Mu2	3.630E+00	;
Mu3	-3.952E-01	;
Mu4	1.745E-02	;
}
CH2(S)
{
Mu1	-2.026E+01	;
Mu2	3.630E+00	;
Mu3	-3.952E-01	;
Mu4	1.745E-02	;
}
CH3
{
Mu1	-2.023E+01	;
Mu2	3.630E+00	;
Mu3	-3.952E-01	;
Mu4	1.745E-02	;
}
CH4
{
Mu1	-2.000E+01	;
Mu2	3.570E+00	;
Mu3	-3.875E-01	;
Mu4	1.712E-02	;
}
CO
{
Mu1	-1.662E+01	;
Mu2	2.401E+00	;
Mu3	-2.358E-01	;
Mu4	1.055E-02	;
}
CO2
{
Mu1	-2.397E+01	;
Mu2	5.130E+00	;
Mu3	-5.724E-01	;
Mu4	2.441E-02	;
}
HCO
{
Mu1	-1.987E+01	;
Mu2	2.704E+00	;
Mu3	-1.672E-01	;
Mu4	3.212E-03	;
}
CH2O
{
Mu1	-1.985E+01	;
Mu2	2.704E+00	;
Mu3	-1.672E-01	;
Mu4	3.212E-03	;
}
CH2OH
{
Mu1	-1.997E+01	;
Mu2	2.862E+00	;
Mu3	-2.025E-01	;
Mu4	5.362E-03	;
}
CH3O
{
Mu1	-1.997E+01	;
Mu2	2.862E+00	;
Mu3	-2.025E-01	;
Mu4	5.362E-03	;
}
CH3OH
{
Mu1	-2.058E+01	;
Mu2	3.046E+00	;
Mu3	-2.180E-01	;
Mu4	5.666E-03	;
}
C2H
{
Mu1	-2.336E+01	;
Mu2	4.790E+00	;
Mu3	-5.365E-01	;
Mu4	2.319E-02	;
}
C2H2
{
Mu1	-2.334E+01	;
Mu2	4.790E+00	;
Mu3	-5.365E-01	;
Mu4	2.319E-02	;
}
C2H3
{
Mu1	-2.332E+01	;
Mu2	4.790E+00	;
Mu3	-5.365E-01	;
Mu4	2.319E-02	;
}
C2H4
{
Mu1	-2.505E+01	;
Mu2	5.333E+00	;
Mu3	-5.890E-01	;
Mu4	2.474E-02	;
}
C2H5
{
Mu1	-2.463E+01	;
Mu2	5.183E+00	;
Mu3	-5.772E-01	;
Mu4	2.453E-02	;
}
C2H6
{
Mu1	-2.461E+01	;
Mu2	5.183E+00	;
Mu3	-5.772E-01	;
Mu4	2.453E-02	;
}
HCCO
{
Mu1	-1.922E+01	;
Mu2	3.751E+00	;
Mu3	-4.103E-01	;
Mu4	1.808E-02	;
}
CH2CO
{
Mu1	-2.234E+01	;
Mu2	3.867E+00	;
Mu3	-3.420E-01	;
Mu4	1.173E-02	;
}
HCCOH
{
Mu1	-2.234E+01	;
Mu2	3.867E+00	;
Mu3	-3.420E-01	;
Mu4	1.173E-02	;
}
N
{
Mu1	-1.495E+01	;
Mu2	1.706E+00	;
Mu3	-1.444E-01	;
Mu4	6.539E-03	;
}
NH
{
Mu1	-1.506E+01	;
Mu2	1.929E+00	;
Mu3	-1.739E-01	;
Mu4	7.841E-03	;
}
NH2
{
Mu1	-1.503E+01	;
Mu2	1.929E+00	;
Mu3	-1.739E-01	;
Mu4	7.841E-03	;
}
NH3
{
Mu1	-1.624E+01	;
Mu2	1.199E+00	;
Mu3	4.381E-02	;
Mu4	-6.469E-03	;
}
NNH
{
Mu1	-1.487E+01	;
Mu2	1.706E+00	;
Mu3	-1.444E-01	;
Mu4	6.539E-03	;
}
NO
{
Mu1	-1.653E+01	;
Mu2	2.388E+00	;
Mu3	-2.341E-01	;
Mu4	1.048E-02	;
}
NO2
{
Mu1	-2.238E+01	;
Mu2	4.669E+00	;
Mu3	-5.223E-01	;
Mu4	2.264E-02	;
}
N2O
{
Mu1	-2.377E+01	;
Mu2	5.067E+00	;
Mu3	-5.675E-01	;
Mu4	2.433E-02	;
}
HNO
{
Mu1	-1.778E+01	;
Mu2	2.899E+00	;
Mu3	-3.007E-01	;
Mu4	1.337E-02	;
}
CN
{
Mu1	-1.518E+01	;
Mu2	1.790E+00	;
Mu3	-1.554E-01	;
Mu4	7.024E-03	;
}
HCN
{
Mu1	-1.681E+01	;
Mu2	1.274E+00	;
Mu3	4.285E-02	;
Mu4	-6.849E-03	;
}
H2CN
{
Mu1	-1.679E+01	;
Mu2	1.274E+00	;
Mu3	4.285E-02	;
Mu4	-6.849E-03	;
}
HCNN
{
Mu1	-1.922E+01	;
Mu2	3.751E+00	;
Mu3	-4.103E-01	;
Mu4	1.808E-02	;
}
HCNO
{
Mu1	-2.378E+01	;
Mu2	5.067E+00	;
Mu3	-5.675E-01	;
Mu4	2.433E-02	;
}
HOCN
{
Mu1	-2.378E+01	;
Mu2	5.067E+00	;
Mu3	-5.675E-01	;
Mu4	2.433E-02	;
}
HNCO
{
Mu1	-2.378E+01	;
Mu2	5.067E+00	;
Mu3	-5.675E-01	;
Mu4	2.433E-02	;
}
NCO
{
Mu1	-2.379E+01	;
Mu2	5.067E+00	;
Mu3	-5.675E-01	;
Mu4	2.433E-02	;
}
N2
{
Mu1	-1.657E+01	;
Mu2	2.388E+00	;
Mu3	-2.341E-01	;
Mu4	1.048E-02	;
}
AR
{
Mu1	-1.904E+01	;
Mu2	3.467E+00	;
Mu3	-3.746E-01	;
Mu4	1.658E-02	;
}
C3H7
{
Mu1	-2.511E+01	;
Mu2	5.297E+00	;
Mu3	-5.884E-01	;
Mu4	2.487E-02	;
}
C3H8
{
Mu1	-2.509E+01	;
Mu2	5.297E+00	;
Mu3	-5.884E-01	;
Mu4	2.487E-02	;
}
CH2CHO
{
Mu1	-2.233E+01	;
Mu2	3.867E+00	;
Mu3	-3.420E-01	;
Mu4	1.173E-02	;
}
CH3CHO
{
Mu1	-2.232E+01	;
Mu2	3.867E+00	;
Mu3	-3.420E-01	;
Mu4	1.173E-02	;
}
