tuts/1D_CH4_premixed_inletoutlet/constant/thermoDiff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoDiff;
}

// Scheme: transport fitting

H2-H2
{
ThermDiff_1	0.000E+00	;
ThermDiff_2	0.000E+00	;
ThermDiff_3	0.000E+00	;
ThermDiff_4	0.000E+00	;
}
H2-H
{
ThermDiff_1	1.442E-01	;
ThermDiff_2	8.000E-05	;
ThermDiff_3	-4.897E-08	;
ThermDiff_4	9.143E-12	;
}
H2-O
{
ThermDiff_1	-4.067E-01	;
ThermDiff_2	-3.847E-05	;
ThermDiff_3	2.548E-08	;
ThermDiff_4	-5.863E-12	;
}
H2-O2
{
ThermDiff_1	-4.266E-01	;
ThermDiff_2	-1.204E-04	;
ThermDiff_3	7.673E-08	;
ThermDiff_4	-1.521E-11	;
}
H2-OH
{
ThermDiff_1	-4.129E-01	;
ThermDiff_2	-3.906E-05	;
ThermDiff_3	2.587E-08	;
ThermDiff_4	-5.953E-12	;
}
H2-H2O
{
ThermDiff_1	-2.275E-02	;
ThermDiff_2	-6.731E-04	;
ThermDiff_3	3.409E-07	;
ThermDiff_4	-5.485E-11	;
}
H2-HO2
{
ThermDiff_1	-4.282E-01	;
ThermDiff_2	-1.209E-04	;
ThermDiff_3	7.703E-08	;
ThermDiff_4	-1.527E-11	;
}
H2-H2O2
{
ThermDiff_1	-4.298E-01	;
ThermDiff_2	-1.213E-04	;
ThermDiff_3	7.731E-08	;
ThermDiff_4	-1.532E-11	;
}
H2-C
{
ThermDiff_1	-3.822E-01	;
ThermDiff_2	-1.472E-05	;
ThermDiff_3	9.760E-09	;
ThermDiff_4	-2.832E-12	;
}
H2-CH
{
ThermDiff_1	-3.834E-01	;
ThermDiff_2	-3.627E-05	;
ThermDiff_3	2.403E-08	;
ThermDiff_4	-5.528E-12	;
}
H2-CH2
{
ThermDiff_1	-3.247E-01	;
ThermDiff_2	-1.778E-04	;
ThermDiff_3	1.089E-07	;
ThermDiff_4	-2.036E-11	;
}
H2-CH2(S)
{
ThermDiff_1	-3.247E-01	;
ThermDiff_2	-1.778E-04	;
ThermDiff_3	1.089E-07	;
ThermDiff_4	-2.036E-11	;
}
H2-CH3
{
ThermDiff_1	-3.312E-01	;
ThermDiff_2	-1.813E-04	;
ThermDiff_3	1.111E-07	;
ThermDiff_4	-2.076E-11	;
}
H2-CH4
{
ThermDiff_1	-3.396E-01	;
ThermDiff_2	-1.793E-04	;
ThermDiff_3	1.101E-07	;
ThermDiff_4	-2.064E-11	;
}
H2-CO
{
ThermDiff_1	-4.306E-01	;
ThermDiff_2	-9.360E-05	;
ThermDiff_3	6.040E-08	;
ThermDiff_4	-1.231E-11	;
}
H2-CO2
{
ThermDiff_1	-2.932E-01	;
ThermDiff_2	-4.014E-04	;
ThermDiff_3	2.307E-07	;
ThermDiff_4	-4.052E-11	;
}
H2-HCO
{
ThermDiff_1	-1.221E-01	;
ThermDiff_2	-6.184E-04	;
ThermDiff_3	3.284E-07	;
ThermDiff_4	-5.446E-11	;
}
H2-CH2O
{
ThermDiff_1	-1.227E-01	;
ThermDiff_2	-6.213E-04	;
ThermDiff_3	3.300E-07	;
ThermDiff_4	-5.472E-11	;
}
H2-CH2OH
{
ThermDiff_1	-1.403E-01	;
ThermDiff_2	-6.013E-04	;
ThermDiff_3	3.219E-07	;
ThermDiff_4	-5.367E-11	;
}
H2-CH3O
{
ThermDiff_1	-1.403E-01	;
ThermDiff_2	-6.013E-04	;
ThermDiff_3	3.219E-07	;
ThermDiff_4	-5.367E-11	;
}
H2-CH3OH
{
ThermDiff_1	-1.314E-01	;
ThermDiff_2	-6.164E-04	;
ThermDiff_3	3.286E-07	;
ThermDiff_4	-5.462E-11	;
}
H2-C2H
{
ThermDiff_1	-3.037E-01	;
ThermDiff_2	-3.225E-04	;
ThermDiff_3	1.887E-07	;
ThermDiff_4	-3.365E-11	;
}
H2-C2H2
{
ThermDiff_1	-3.056E-01	;
ThermDiff_2	-3.245E-04	;
ThermDiff_3	1.899E-07	;
ThermDiff_4	-3.387E-11	;
}
H2-C2H3
{
ThermDiff_1	-3.074E-01	;
ThermDiff_2	-3.264E-04	;
ThermDiff_3	1.910E-07	;
ThermDiff_4	-3.406E-11	;
}
H2-C2H4
{
ThermDiff_1	-2.490E-01	;
ThermDiff_2	-4.290E-04	;
ThermDiff_3	2.427E-07	;
ThermDiff_4	-4.208E-11	;
}
H2-C2H5
{
ThermDiff_1	-2.728E-01	;
ThermDiff_2	-3.944E-04	;
ThermDiff_3	2.258E-07	;
ThermDiff_4	-3.953E-11	;
}
H2-C2H6
{
ThermDiff_1	-2.740E-01	;
ThermDiff_2	-3.962E-04	;
ThermDiff_3	2.269E-07	;
ThermDiff_4	-3.972E-11	;
}
H2-HCCO
{
ThermDiff_1	-3.861E-01	;
ThermDiff_2	-2.288E-04	;
ThermDiff_3	1.394E-07	;
ThermDiff_4	-2.590E-11	;
}
H2-CH2CO
{
ThermDiff_1	-1.593E-01	;
ThermDiff_2	-6.028E-04	;
ThermDiff_3	3.248E-07	;
ThermDiff_4	-5.439E-11	;
}
H2-HCCOH
{
ThermDiff_1	-1.593E-01	;
ThermDiff_2	-6.028E-04	;
ThermDiff_3	3.248E-07	;
ThermDiff_4	-5.439E-11	;
}
H2-N
{
ThermDiff_1	-4.014E-01	;
ThermDiff_2	-1.546E-05	;
ThermDiff_3	1.025E-08	;
ThermDiff_4	-2.974E-12	;
}
H2-NH
{
ThermDiff_1	-3.999E-01	;
ThermDiff_2	-3.783E-05	;
ThermDiff_3	2.506E-08	;
ThermDiff_4	-5.765E-12	;
}
H2-NH2
{
ThermDiff_1	-4.068E-01	;
ThermDiff_2	-3.848E-05	;
ThermDiff_3	2.549E-08	;
ThermDiff_4	-5.865E-12	;
}
H2-NH3
{
ThermDiff_1	-8.775E-02	;
ThermDiff_2	-5.895E-04	;
ThermDiff_3	3.094E-07	;
ThermDiff_4	-5.090E-11	;
}
H2-NNH
{
ThermDiff_1	-4.668E-01	;
ThermDiff_2	-1.797E-05	;
ThermDiff_3	1.192E-08	;
ThermDiff_4	-3.458E-12	;
}
H2-NO
{
ThermDiff_1	-4.355E-01	;
ThermDiff_2	-9.294E-05	;
ThermDiff_3	6.002E-08	;
ThermDiff_4	-1.226E-11	;
}
H2-NO2
{
ThermDiff_1	-3.359E-01	;
ThermDiff_2	-3.314E-04	;
ThermDiff_3	1.949E-07	;
ThermDiff_4	-3.493E-11	;
}
H2-N2O
{
ThermDiff_1	-3.036E-01	;
ThermDiff_2	-3.839E-04	;
ThermDiff_3	2.219E-07	;
ThermDiff_4	-3.915E-11	;
}
H2-HNO
{
ThermDiff_1	-4.133E-01	;
ThermDiff_2	-1.439E-04	;
ThermDiff_3	9.066E-08	;
ThermDiff_4	-1.761E-11	;
}
H2-CN
{
ThermDiff_1	-4.548E-01	;
ThermDiff_2	-2.809E-05	;
ThermDiff_3	1.869E-08	;
ThermDiff_4	-4.716E-12	;
}
H2-HCN
{
ThermDiff_1	-9.061E-02	;
ThermDiff_2	-6.505E-04	;
ThermDiff_3	3.405E-07	;
ThermDiff_4	-5.593E-11	;
}
H2-H2CN
{
ThermDiff_1	-9.110E-02	;
ThermDiff_2	-6.540E-04	;
ThermDiff_3	3.423E-07	;
ThermDiff_4	-5.623E-11	;
}
H2-HCNN
{
ThermDiff_1	-3.861E-01	;
ThermDiff_2	-2.288E-04	;
ThermDiff_3	1.394E-07	;
ThermDiff_4	-2.590E-11	;
}
H2-HCNO
{
ThermDiff_1	-3.029E-01	;
ThermDiff_2	-3.831E-04	;
ThermDiff_3	2.214E-07	;
ThermDiff_4	-3.906E-11	;
}
H2-HOCN
{
ThermDiff_1	-3.029E-01	;
ThermDiff_2	-3.831E-04	;
ThermDiff_3	2.214E-07	;
ThermDiff_4	-3.906E-11	;
}
H2-HNCO
{
ThermDiff_1	-3.029E-01	;
ThermDiff_2	-3.831E-04	;
ThermDiff_3	2.214E-07	;
ThermDiff_4	-3.906E-11	;
}
H2-NCO
{
ThermDiff_1	-3.023E-01	;
ThermDiff_2	-3.822E-04	;
ThermDiff_3	2.209E-07	;
ThermDiff_4	-3.898E-11	;
}
H2-N2
{
ThermDiff_1	-4.313E-01	;
ThermDiff_2	-9.205E-05	;
ThermDiff_3	5.945E-08	;
ThermDiff_4	-1.214E-11	;
}
H2-AR
{
ThermDiff_1	-4.010E-01	;
ThermDiff_2	-1.973E-04	;
ThermDiff_3	1.217E-07	;
ThermDiff_4	-2.294E-11	;
}
H2-C3H7
{
ThermDiff_1	-2.732E-01	;
ThermDiff_2	-4.328E-04	;
ThermDiff_3	2.462E-07	;
ThermDiff_4	-4.289E-11	;
}
H2-C3H8
{
ThermDiff_1	-2.738E-01	;
ThermDiff_2	-4.337E-04	;
ThermDiff_3	2.467E-07	;
ThermDiff_4	-4.298E-11	;
}
H2-CH2CHO
{
ThermDiff_1	-1.596E-01	;
ThermDiff_2	-6.042E-04	;
ThermDiff_3	3.256E-07	;
ThermDiff_4	-5.451E-11	;
}
H2-CH3CHO
{
ThermDiff_1	-1.600E-01	;
ThermDiff_2	-6.055E-04	;
ThermDiff_3	3.263E-07	;
ThermDiff_4	-5.463E-11	;
}
H-H2
{
ThermDiff_1	-1.442E-01	;
ThermDiff_2	-8.000E-05	;
ThermDiff_3	4.897E-08	;
ThermDiff_4	-9.143E-12	;
}
H-H
{
ThermDiff_1	0.000E+00	;
ThermDiff_2	0.000E+00	;
ThermDiff_3	0.000E+00	;
ThermDiff_4	0.000E+00	;
}
H-O
{
ThermDiff_1	-2.353E-01	;
ThermDiff_2	-4.657E-04	;
ThermDiff_3	2.609E-07	;
ThermDiff_4	-4.493E-11	;
}
H-O2
{
ThermDiff_1	-1.798E-01	;
ThermDiff_2	-6.017E-04	;
ThermDiff_3	3.264E-07	;
ThermDiff_4	-5.491E-11	;
}
H-OH
{
ThermDiff_1	-2.371E-01	;
ThermDiff_2	-4.692E-04	;
ThermDiff_3	2.629E-07	;
ThermDiff_4	-4.527E-11	;
}
H-H2O
{
ThermDiff_1	1.744E-01	;
ThermDiff_2	-8.622E-04	;
ThermDiff_3	3.795E-07	;
ThermDiff_4	-5.603E-11	;
}
H-HO2
{
ThermDiff_1	-1.802E-01	;
ThermDiff_2	-6.029E-04	;
ThermDiff_3	3.271E-07	;
ThermDiff_4	-5.502E-11	;
}
H-H2O2
{
ThermDiff_1	-1.805E-01	;
ThermDiff_2	-6.040E-04	;
ThermDiff_3	3.277E-07	;
ThermDiff_4	-5.512E-11	;
}
H-C
{
ThermDiff_1	-2.493E-01	;
ThermDiff_2	-4.087E-04	;
ThermDiff_3	2.319E-07	;
ThermDiff_4	-4.033E-11	;
}
H-CH
{
ThermDiff_1	-2.286E-01	;
ThermDiff_2	-4.524E-04	;
ThermDiff_3	2.535E-07	;
ThermDiff_4	-4.364E-11	;
}
H-CH2
{
ThermDiff_1	-9.908E-02	;
ThermDiff_2	-6.442E-04	;
ThermDiff_3	3.385E-07	;
ThermDiff_4	-5.574E-11	;
}
H-CH2(S)
{
ThermDiff_1	-9.908E-02	;
ThermDiff_2	-6.442E-04	;
ThermDiff_3	3.385E-07	;
ThermDiff_4	-5.574E-11	;
}
H-CH3
{
ThermDiff_1	-1.000E-01	;
ThermDiff_2	-6.505E-04	;
ThermDiff_3	3.418E-07	;
ThermDiff_4	-5.628E-11	;
}
H-CH4
{
ThermDiff_1	-1.051E-01	;
ThermDiff_2	-6.507E-04	;
ThermDiff_3	3.426E-07	;
ThermDiff_4	-5.648E-11	;
}
H-CO
{
ThermDiff_1	-2.001E-01	;
ThermDiff_2	-5.648E-04	;
ThermDiff_3	3.094E-07	;
ThermDiff_4	-5.241E-11	;
}
H-CO2
{
ThermDiff_1	2.003E-02	;
ThermDiff_2	-8.504E-04	;
ThermDiff_3	4.211E-07	;
ThermDiff_4	-6.680E-11	;
}
H-HCO
{
ThermDiff_1	1.610E-01	;
ThermDiff_2	-9.038E-04	;
ThermDiff_3	4.069E-07	;
ThermDiff_4	-6.092E-11	;
}
H-CH2O
{
ThermDiff_1	1.614E-01	;
ThermDiff_2	-9.059E-04	;
ThermDiff_3	4.079E-07	;
ThermDiff_4	-6.106E-11	;
}
H-CH2OH
{
ThermDiff_1	1.312E-01	;
ThermDiff_2	-9.039E-04	;
ThermDiff_3	4.178E-07	;
ThermDiff_4	-6.357E-11	;
}
H-CH3O
{
ThermDiff_1	1.312E-01	;
ThermDiff_2	-9.039E-04	;
ThermDiff_3	4.178E-07	;
ThermDiff_4	-6.357E-11	;
}
H-CH3OH
{
ThermDiff_1	1.567E-01	;
ThermDiff_2	-9.098E-04	;
ThermDiff_3	4.117E-07	;
ThermDiff_4	-6.183E-11	;
}
H-C2H
{
ThermDiff_1	-1.627E-02	;
ThermDiff_2	-7.877E-04	;
ThermDiff_3	3.971E-07	;
ThermDiff_4	-6.369E-11	;
}
H-C2H2
{
ThermDiff_1	-1.632E-02	;
ThermDiff_2	-7.901E-04	;
ThermDiff_3	3.983E-07	;
ThermDiff_4	-6.389E-11	;
}
H-C2H3
{
ThermDiff_1	-1.637E-02	;
ThermDiff_2	-7.924E-04	;
ThermDiff_3	3.994E-07	;
ThermDiff_4	-6.407E-11	;
}
H-C2H4
{
ThermDiff_1	5.087E-02	;
ThermDiff_2	-8.543E-04	;
ThermDiff_3	4.159E-07	;
ThermDiff_4	-6.531E-11	;
}
H-C2H5
{
ThermDiff_1	2.717E-02	;
ThermDiff_2	-8.372E-04	;
ThermDiff_3	4.129E-07	;
ThermDiff_4	-6.534E-11	;
}
H-C2H6
{
ThermDiff_1	2.723E-02	;
ThermDiff_2	-8.392E-04	;
ThermDiff_3	4.138E-07	;
ThermDiff_4	-6.549E-11	;
}
H-HCCO
{
ThermDiff_1	-9.869E-02	;
ThermDiff_2	-7.210E-04	;
ThermDiff_3	3.771E-07	;
ThermDiff_4	-6.192E-11	;
}
H-CH2CO
{
ThermDiff_1	1.416E-01	;
ThermDiff_2	-9.214E-04	;
ThermDiff_3	4.232E-07	;
ThermDiff_4	-6.414E-11	;
}
H-HCCOH
{
ThermDiff_1	1.416E-01	;
ThermDiff_2	-9.214E-04	;
ThermDiff_3	4.232E-07	;
ThermDiff_4	-6.414E-11	;
}
H-N
{
ThermDiff_1	-2.553E-01	;
ThermDiff_2	-4.186E-04	;
ThermDiff_3	2.376E-07	;
ThermDiff_4	-4.131E-11	;
}
H-NH
{
ThermDiff_1	-2.333E-01	;
ThermDiff_2	-4.618E-04	;
ThermDiff_3	2.588E-07	;
ThermDiff_4	-4.456E-11	;
}
H-NH2
{
ThermDiff_1	-2.353E-01	;
ThermDiff_2	-4.658E-04	;
ThermDiff_3	2.610E-07	;
ThermDiff_4	-4.494E-11	;
}
H-NH3
{
ThermDiff_1	1.479E-01	;
ThermDiff_2	-8.606E-04	;
ThermDiff_3	3.896E-07	;
ThermDiff_4	-5.851E-11	;
}
H-NNH
{
ThermDiff_1	-2.751E-01	;
ThermDiff_2	-4.511E-04	;
ThermDiff_3	2.560E-07	;
ThermDiff_4	-4.451E-11	;
}
H-NO
{
ThermDiff_1	-2.025E-01	;
ThermDiff_2	-5.654E-04	;
ThermDiff_3	3.100E-07	;
ThermDiff_4	-5.253E-11	;
}
H-NO2
{
ThermDiff_1	-2.760E-02	;
ThermDiff_2	-8.062E-04	;
ThermDiff_3	4.084E-07	;
ThermDiff_4	-6.572E-11	;
}
H-N2O
{
ThermDiff_1	8.570E-03	;
ThermDiff_2	-8.401E-04	;
ThermDiff_3	4.183E-07	;
ThermDiff_4	-6.659E-11	;
}
H-HNO
{
ThermDiff_1	-1.591E-01	;
ThermDiff_2	-6.289E-04	;
ThermDiff_3	3.381E-07	;
ThermDiff_4	-5.653E-11	;
}
H-CN
{
ThermDiff_1	-2.618E-01	;
ThermDiff_2	-4.654E-04	;
ThermDiff_3	2.627E-07	;
ThermDiff_4	-4.548E-11	;
}
H-HCN
{
ThermDiff_1	1.802E-01	;
ThermDiff_2	-8.954E-04	;
ThermDiff_3	3.945E-07	;
ThermDiff_4	-5.828E-11	;
}
H-H2CN
{
ThermDiff_1	1.806E-01	;
ThermDiff_2	-8.978E-04	;
ThermDiff_3	3.956E-07	;
ThermDiff_4	-5.843E-11	;
}
H-HCNN
{
ThermDiff_1	-9.869E-02	;
ThermDiff_2	-7.210E-04	;
ThermDiff_3	3.771E-07	;
ThermDiff_4	-6.192E-11	;
}
H-HCNO
{
ThermDiff_1	8.561E-03	;
ThermDiff_2	-8.392E-04	;
ThermDiff_3	4.179E-07	;
ThermDiff_4	-6.652E-11	;
}
H-HOCN
{
ThermDiff_1	8.561E-03	;
ThermDiff_2	-8.392E-04	;
ThermDiff_3	4.179E-07	;
ThermDiff_4	-6.652E-11	;
}
H-HNCO
{
ThermDiff_1	8.561E-03	;
ThermDiff_2	-8.392E-04	;
ThermDiff_3	4.179E-07	;
ThermDiff_4	-6.652E-11	;
}
H-NCO
{
ThermDiff_1	8.552E-03	;
ThermDiff_2	-8.383E-04	;
ThermDiff_3	4.174E-07	;
ThermDiff_4	-6.645E-11	;
}
H-N2
{
ThermDiff_1	-2.015E-01	;
ThermDiff_2	-5.627E-04	;
ThermDiff_3	3.085E-07	;
ThermDiff_4	-5.228E-11	;
}
H-AR
{
ThermDiff_1	-1.222E-01	;
ThermDiff_2	-6.903E-04	;
ThermDiff_3	3.648E-07	;
ThermDiff_4	-6.031E-11	;
}
H-C3H7
{
ThermDiff_1	4.062E-02	;
ThermDiff_2	-8.670E-04	;
ThermDiff_3	4.247E-07	;
ThermDiff_4	-6.694E-11	;
}
H-C3H8
{
ThermDiff_1	4.066E-02	;
ThermDiff_2	-8.680E-04	;
ThermDiff_3	4.252E-07	;
ThermDiff_4	-6.701E-11	;
}
H-CH2CHO
{
ThermDiff_1	1.418E-01	;
ThermDiff_2	-9.224E-04	;
ThermDiff_3	4.237E-07	;
ThermDiff_4	-6.421E-11	;
}
H-CH3CHO
{
ThermDiff_1	1.420E-01	;
ThermDiff_2	-9.234E-04	;
ThermDiff_3	4.241E-07	;
ThermDiff_4	-6.428E-11	;
}
